andrevcn/MCU_RX100/dataflash/FDL/lib/r_fdl_hw_access.c
#ifdef ENABLE_QAC_TEST
    #pragma PRQA_MESSAGES_OFF 0292
#endif
/***********************************************************************************************************************
* Library       : Data Flash Access Library for Renesas RX111 devices, based on the MF3 Flash technology
*
* File Name     : $Source: r_fdl_hw_access.c $
* Lib. Version  : $RX111_FDL_LIB_VERSION_T01: V1.01 $
* Mod. Revision : $Revision: 1.16 $
* Mod. Date     : $Date: 2013/06/25 10:52:19MESZ $
* Device(s)     : MF3 Flash based RX111 microcontroller
* Description   : FDL hardware interface functions
***********************************************************************************************************************/

/***********************************************************************************************************************
* DISCLAIMER
* This software is supplied by Renesas Electronics Corporation and is only  intended for use with
* Renesas products. No other uses are authorized. This software is owned by Renesas Electronics
* Corporation and is protected under all applicable laws, including copyright laws.
* THIS SOFTWARE IS PROVIDED "AS IS" AND RENESAS MAKES NO WARRANTIES REGARDING THIS SOFTWARE,
* WHETHER EXPRESS, IMPLIED OR STATUTORY, INCLUDING BUT NOT LIMITED TO WARRANTIES OF MERCHANTABILITY,
* FITNESS FOR A PARTICULAR PURPOSE AND NON-INFRINGEMENT. ALL SUCH WARRANTIES ARE EXPRESSLY DISCLAIMED.
* TO THE MAXIMUM EXTENT PERMITTED NOT PROHIBITED BY LAW, NEITHER RENESAS ELECTRONICS CORPORATION NOR
* ANY OF ITS AFFILIATED COMPANIES SHALL BE LIABLE FOR ANY DIRECT, INDIRECT, SPECIAL, INCIDENTAL OR
* CONSEQUENTIAL DAMAGES FOR ANY REASON RELATED TO THIS SOFTWARE, EVEN IF RENESAS OR ITS AFFILIATES HAVE
* BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES.
* Renesas reserves the right, without notice, to make changes to this software and to discontinue the
* availability of this software. By using this software, you agree to the additional terms and conditions
* found by accessing the  following link:
* http://www.renesas.com/disclaimer
*
* Copyright (C) 2012-2013 Renesas Electronics Corporation. All rights reserved.
***********************************************************************************************************************/

#ifdef ENABLE_QAC_TEST
    #pragma PRQA_MESSAGES_ON 0292
#endif

/***********************************************************************************************************************
* MISRA Rule:   MISRA-C 2004 rule 3.1 (QAC message 0292)
* Reason:       To support automatic insertion of revision, module name etc. by the source
*               revision control system it is necessary to violate the rule, because the
*               system uses non basic characters as placeholders.
* Verification: The placeholders are used in commentars only. Therefore rule violation cannot
*               influency code compilation.
***********************************************************************************************************************/

/***********************************************************************************************************************
Includes   <System Includes> , "Project Includes"
***********************************************************************************************************************/
#include "r_cg_macrodriver.h"
#include "r_fdl_env.h"
#include "r_fdl_types.h"
#include "r_fdl.h"
#include "r_fdl_global.h"
#include "fdl_cfg.h"

/***********************************************************************************************************************
 Compiler and device specific
***********************************************************************************************************************/
#if   FDL_COMPILER == FDL_COMP_GCC
    #include "rx111.h"
#elif FDL_COMPILER == FDL_COMP_GHS
#elif FDL_COMPILER == FDL_COMP_IAR
    #include "iorx111.h"
    #pragma location = "R_FDL_TEXT"
#elif FDL_COMPILER == FDL_COMP_REC
    #include "rx111_iodefine_v050.h"
    #pragma section P R_FDL_TEXT
#endif

/***********************************************************************************************************************
Private global variables and functions
***********************************************************************************************************************/
FDL_STATIC uint16_t       R_FDL_ReadMemoryU16     (const uint32_t addr_u32) GCC_SECTION ("R_FDL_TEXT");
FDL_STATIC uint8_t        R_FDL_ReadMemoryU08     (const uint32_t addr_u32) GCC_SECTION ("R_FDL_TEXT");
FDL_STATIC void           R_FDL_WriteMemoryU16    (const uint32_t addr_u32,
                                                   const uint16_t val_u16) GCC_SECTION ("R_FDL_TEXT");
FDL_STATIC r_fdl_status_t R_FDL_ChkAccessRight    (const r_fdl_accessType_t access_type_enu,
                                                   const uint16_t fcu_cmd_u16) GCC_SECTION ("R_FDL_TEXT");
FDL_STATIC void           R_FDL_FCB_WriteRegFLPMC (const uint16_t val_u16) GCC_SECTION ("R_FDL_TEXT");

FDL_STATIC void           R_FDL_WaitUs            (uint32_t tim_u32,
                                                   uint32_t freq_u32) GCC_ATTRIB_NOINLINE GCC_SECTION ("R_FDL_TEXT");
#if FDL_COMPILER == FDL_COMP_REC
    static void           wait_us_asm             (uint32_t tim_u32, uint32_t freq_u32);
#endif
/***********************************************************************************************************************
 * Function name: R_FDL_ReadMemoryU16
 **********************************************************************************************************************/
/**
 * Function to read a 16-bit IO register or memory
 *
 * @param[in]  addr_u32 - source address
 * @return     16-bit register contents
 */
/**********************************************************************************************************************/
/***********************************************************************************************************************
* MISRA Rule:   MISRA-C 2004 rule 11.3 (QAC message 0303)
* Reason:       For effective embedded programming, integer to pointer conversions are used
* Verification: The converted addresses are essential for complete code execution. Incorrect
*               conversion would result in test fails.
***********************************************************************************************************************/
#if FDL_COMPILER == FDL_COMP_IAR
    #pragma location = "R_FDL_TEXT"
#elif FDL_COMPILER == FDL_COMP_REC
    #pragma section P R_FDL_TEXT
#endif
FDL_STATIC uint16_t R_FDL_ReadMemoryU16 (const uint32_t addr_u32)
{
    return ( *( (volatile uint16_t *)(addr_u32) ) );                           /* PRQA S 0303 */
}


