andrevcn/MCU_RX100/dataflash/FDL/lib/r_fdl_hw_access.c
/***********************************************************************************************************************
 * Function name: R_FDL_ReadMemoryU08
 **********************************************************************************************************************/
/**
 * Function to read a 8-bit IO register or memory
 *
 * @param[in]  addr_u32 - source address
 * @return     8-bit register contents
 */
/**********************************************************************************************************************/
/***********************************************************************************************************************
* MISRA Rule:   MISRA-C 2004 rule 11.3 (QAC message 0303)
* Reason:       For effective embedded programming, integer to pointer conversions are used
* Verification: The converted addresses are essential for complete code execution. Incorrect
*               conversion would result in test fails.
***********************************************************************************************************************/
#if FDL_COMPILER == FDL_COMP_IAR
    #pragma location = "R_FDL_TEXT"
#elif FDL_COMPILER == FDL_COMP_REC
    #pragma section P R_FDL_TEXT
#endif
FDL_STATIC uint8_t R_FDL_ReadMemoryU08 (const uint32_t addr_u32)
{
    return ( *( (volatile uint8_t *)(addr_u32) ) );                            /* PRQA S 0303 */
}

/***********************************************************************************************************************
 * Function name: R_FDL_WriteMemoryU16
 **********************************************************************************************************************/
/**
 * Function to write a 16-bit IO register or memory
 *
 * @param[in]  addr_u32 - write destination address
 * @param[in]  val_u16  - 16-bit write data
 * @return     void
 */
/**********************************************************************************************************************/
/***********************************************************************************************************************
* MISRA Rule:   MISRA-C 2004 rule 11.3 (QAC message 0303)
* Reason:       For effective embedded programming, integer to pointer conversions are used
* Verification: The converted addresses are essential for complete code execution. Incorrect
*               conversion would result in test fails.
***********************************************************************************************************************/
#if FDL_COMPILER == FDL_COMP_IAR
    #pragma location = "R_FDL_TEXT"
#elif FDL_COMPILER == FDL_COMP_REC
    #pragma section P R_FDL_TEXT
#endif
FDL_STATIC void R_FDL_WriteMemoryU16 (const uint32_t addr_u32, const uint16_t val_u16)
{
    ( *( (volatile uint16_t *)(addr_u32) ) ) = val_u16;                        /* PRQA S 0303 */
}


/***********************************************************************************************************************
 * Function name: R_FDL_ChkAccessRight
 **********************************************************************************************************************/
/**
 * The check is a robustness feature against modification from outside the library as the parameter
 * check during command initiation should have detected any parameter error already. This check
 * shall block wrong settings directly before starting the Flash hardware. So,
 * on violation, the returned error is a protection error, not a parameter error. \n
 * The function reads back the access parameters from the FCB for the check and compares them
 * against the access rights defined by the descriptor.
 *
 * @param[in]  access_type_enu - type of FDL access (user or EEL)
 * @param[in]  fcu_cmd_u16  - FCB command
 *
 * @return      Returns the access check result
 * @li          R_FDL_OK (check was OK)
 * @li          R_FDL_ERR_PROTECTION (parameter detected)
 */
/**********************************************************************************************************************/
#if FDL_COMPILER == FDL_COMP_IAR
    #pragma location = "R_FDL_TEXT"
#elif FDL_COMPILER == FDL_COMP_REC
    #pragma section P R_FDL_TEXT
#endif
FDL_STATIC r_fdl_status_t R_FDL_ChkAccessRight (const r_fdl_accessType_t access_type_enu,
                                                  const uint16_t fcu_cmd_u16)
{
    r_fdl_status_t status;
    uint32_t       start_addr;
    uint32_t       byte_cnt;

    start_addr =  R_FDL_ReadMemoryU08 (FCB_REGADD_FLAPH_U08);
    start_addr <<= NO_16;
    start_addr += R_FDL_ReadMemoryU16 (FCB_REGADD_FLAPL_U16);

    if (FCB_REGPAT_FSSQ_CMD_WRT == fcu_cmd_u16)
    {
        byte_cnt = FDL_WRITE_SIZE; /* Write one write unit */
    }
    else
    {
        byte_cnt =  R_FDL_ReadMemoryU08 (FCB_REGADD_FLSEDH_U08);
        byte_cnt <<= NO_16;
        byte_cnt += R_FDL_ReadMemoryU16 (FCB_REGADD_FLSEDL_U16);
        byte_cnt =  (byte_cnt - start_addr);
        if (FCB_REGPAT_FSSQ_CMD_BC == fcu_cmd_u16)
        {
            /* make byte count from end address */
            byte_cnt += FDL_WRITE_SIZE;
        }
    }

    start_addr -= FDL_DF_BASE_ADD;

    #ifdef PATCH_TO_SIMULATE_ERRORS
        if (R_FDL_TRUE == g_fdl_data_str.simError_enu)
        {
            if (R_FDL_SIM_ERROR_PROTECTION == g_fdl_data_str.simErrorType_enu)
            {
                /* byte_cnt = 0 must raise a protection error */
                byte_cnt = 0;
                g_fdl_data_str.simError_enu = R_FDL_FALSE;
            }
        }
    #endif

    status = R_FDL_ChkAccessBoundaries (start_addr, byte_cnt, access_type_enu);
    /* R_FDL_ChkAccessBoundaries returns PARAMETER error as it is used in R_FDL_Execute for
       parameter check. If we check directly before Flash operation start, we want to return
       R_FDL_ERR_PROTECTION in error case. So we patch the return value here */
    if (R_FDL_ERR_PARAMETER == status)
    {
        R_FDL_FCB_Reset ();
        (void)R_FDL_FCB_SwitchMode (R_FDL_FCB_MODE_USER);
        status = R_FDL_ERR_PROTECTION;
    }

    return (status);
} /* R_FDL_ChkAccessRight */


