andrevcn/MCU_RX100/dataflash/FDL/lib/r_fdl_hw_access.c
/***********************************************************************************************************************
 * Function name: R_FDL_FCB_WriteRegFLPMC
 **********************************************************************************************************************/
/**
 * Write the FLPMC register, that is secured by a special sequence. The write must be ckecked in
 * a loop, as a DMA or interrupt handling can lead to an wrong sequence, thus preventing the write.
 * In this case the write must be repeated
 *
 * @param[in]  val_u16 - register target value
 *
 * @return     void
 */
/**********************************************************************************************************************/
#if FDL_COMPILER == FDL_COMP_IAR
    #pragma location = "R_FDL_TEXT"
#elif FDL_COMPILER == FDL_COMP_REC
    #pragma section P R_FDL_TEXT
#endif
FDL_STATIC void R_FDL_FCB_WriteRegFLPMC (const uint16_t val_u16)
{
    volatile uint16_t regFLPMC;

    do
    {
        R_FDL_WriteMemoryU08 (FCB_REGADD_PFCMD_U08, FCB_REGPAT_PFCMD_U16);
        R_FDL_WriteMemoryU08 (FCB_REGADD_FLPMC_U08, (uint8_t)val_u16);
        R_FDL_WriteMemoryU08 ( FCB_REGADD_FLPMC_U08, (uint8_t)(~val_u16) );
        R_FDL_WriteMemoryU08 (FCB_REGADD_FLPMC_U08, (uint8_t)val_u16);
        regFLPMC = R_FDL_ReadMemoryU08 (FCB_REGADD_FLPMC_U08);
    }
    while (regFLPMC != val_u16);
}


/***********************************************************************************************************************
 * Function name: R_FDL_WaitUs
 **********************************************************************************************************************/
/**
 * Software wait loop.
 * The function wait for x us @ the frequency configured by the parameter.
 * Note: The accuracy is rather low for low frequencies and low wait times because the loop
 *       count is an integer value of tim*freq/8   \n
 *
 * The function uses assembler instructions in order to reduce the dependancy on copiler
 * optimizations
 *
 * @param      tim - us to wait
 * @param      freq - device frequency
 * @return     void
 */
/**********************************************************************************************************************/
/*********************************************************************************************************************
 * MISRA Rule:   MISRA-C 2004 rule 3.1 (QAC message 3206)
 * Reason:       function parameter seems to be not used in the function as no c-code relates on it,
 *               but the assembler code uses the parameter
 * Verification: -
 *********************************************************************************************************************/
#if FDL_COMPILER == FDL_COMP_GCC
    FDL_STATIC void R_FDL_WaitUs (uint32_t tim_u32, uint32_t freq_u32)
    {
        asm ("MUL r1, r2");

        /* the wait loop shall last 8 clocks */
        asm ("SHAR #3, r2");

        /* wait loop */
        asm ("_R_FDL_WaitUs_Loop:");
        asm ("BZ _R_FDL_WaitUs_End");
        asm ("nop");
        asm ("nop");
        asm ("nop");
        asm ("ADD #-1, r2");
        asm ("BRA.B _R_FDL_WaitUs_Loop");
        asm ("_R_FDL_WaitUs_End:");
    } /* R_FDL_WaitUs */
#elif FDL_COMPILER == FDL_COMP_IAR
    #pragma location = "R_FDL_TEXT"
    FDL_STATIC void R_FDL_WaitUs (uint32_t tim_u32, uint32_t freq_u32)
    {
        /* the wait loop shall last 8 clocks */
        __asm ("MUL r1, r2\n"
               "SHAR #3, r2\n"
               "_R_FDL_WaitUs_Loop:\n"
               "bz.b _R_FDL_WaitUs_End\n"
               "nop\n"
               "nop\n"
               "nop\n"
               "ADD #-1, r2\n"
               "BRA.B _R_FDL_WaitUs_Loop\n"
               "_R_FDL_WaitUs_End:");
    } /* R_FDL_WaitUs */
#elif FDL_COMPILER == FDL_COMP_REC
    #pragma section P R_FDL_TEXT
    #pragma inline_asm wait_us_asm
    static void wait_us_asm (uint32_t tim_u32, uint32_t freq_u32)               /* PRQA S 3206 */
    {
        #ifndef ENABLE_QAC_TEST
            MUL r1, r2

            /* the wait loop shall last 8 clocks */
            SHAR #3, r2

            /* wait loop */
        Wait_us_Loop:
            BZ Wait_us_End
            nop
            nop
            nop
            ADD #-1, r2
            BRA.B Wait_us_Loop
        Wait_us_End:
        #endif
    }

    FDL_STATIC void R_FDL_WaitUs (uint32_t tim_u32, uint32_t freq_u32)
    {
        /* wrap over wait_us_asm because that function is inlined and can be used only once */
        wait_us_asm (tim_u32, freq_u32);
    }
#else
    #error "Unknown compiler"
#endif /* if FDL_COMPILER */


/***********************************************************************************************************************
        Public interface functions from now on
 **********************************************************************************************************************/
/***********************************************************************************************************************
 * Function name: R_FDL_WriteMemoryU08
 **********************************************************************************************************************/
/**
 * Function to write a 8-bit IO register or memory
 *
 * @param[in]  add_u32 - write destination address
 * @param[in]  val_u8  - 8-bit write data
 * @return     void
 */
/**********************************************************************************************************************/
/***********************************************************************************************************************
* MISRA Rule:   MISRA-C 2004 rule 11.3 (QAC message 0303)
* Reason:       For effective embedded programming, integer to pointer conversions are used
* Verification: The converted addresses are essential for complete code execution. Incorrect
*               conversion would result in test fails.
***********************************************************************************************************************/
#if FDL_COMPILER == FDL_COMP_IAR
    #pragma location = "R_FDL_TEXT"
#elif FDL_COMPILER == FDL_COMP_REC
    #pragma section P R_FDL_TEXT
#endif
void R_FDL_WriteMemoryU08 (const uint32_t add_u32, const uint8_t val_u8)
{
    ( *( (volatile uint8_t *)(add_u32) ) ) = val_u8;                           /* PRQA S 0303 */
}


