andrevcn/MCU_RX100/dataflash/FDL/lib/r_fdl_hw_access.c
/***********************************************************************************************************************
 * Function name: R_FDL_ChkAccessBoundaries
 **********************************************************************************************************************/
/**
 * This function checks if the Flash access boundaries are correct. Parameter error if:
 * - end address calc. wrap around
 * - end address overflow
 * - selected block range is not in the correct pool (User/EEL)
 *
 * @param[in]   access_type_enu  - type of FDL access (user or EEL)
 * @param[in]   start_addr_u32 - Start of the block range to access
 * @param[in]   byte_cnt_u32   - Number of Bytes for the access
 * @return      Returns the access check result
 * @li          R_FDL_BUSY (check was OK)
 * @li          R_FDL_ERR_PARAMETER (parameter error detected)
 */
/**********************************************************************************************************************/
#if FDL_COMPILER == FDL_COMP_IAR
    #pragma location = "R_FDL_TEXT"
#elif FDL_COMPILER == FDL_COMP_REC
    #pragma section P R_FDL_TEXT
#endif
r_fdl_status_t R_FDL_ChkAccessBoundaries (const uint32_t start_addr_u32,
                                          const uint32_t byte_cnt_u32,
                                          const r_fdl_accessType_t access_type_enu)
{
    uint32_t       eel_pool_start;
    uint32_t       eel_pool_size;
    uint32_t       eel_pool_end;
    uint32_t       fdl_pool_end;
    uint32_t       end_addr;
    r_fdl_flag_t   in_eel_range;
    r_fdl_status_t status = R_FDL_BUSY;

    eel_pool_start = ( (g_fdl_data_str.RTCfg_pstr)->eelPoolStart_u16 ) << FDL_BLOCK_SIZE_2N;
    eel_pool_size  = ( (g_fdl_data_str.RTCfg_pstr)->eelPoolSize_u16 ) << FDL_BLOCK_SIZE_2N;
    eel_pool_end   = (eel_pool_start + eel_pool_size) - 1u;
    fdl_pool_end   = ( ( (g_fdl_data_str.RTCfg_pstr)->fdlPoolSize_u16 ) << FDL_BLOCK_SIZE_2N ) - 1uL;
    end_addr       = (start_addr_u32 + byte_cnt_u32) - 1uL;
    in_eel_range   = R_FDL_FALSE;

    /* ------------- Judge invalid addresses ------------ */
    if ( (start_addr_u32 > end_addr) ||                                 /* end address calc. wrap around */
         (end_addr >= FDL_DF_SIZE_CHECK_LIMIT) )                        /* end address overflow */
    {
        status = R_FDL_ERR_PARAMETER;
    }
    else
    {
        /* ------------- Judge access boundaries ------------ */
        /* Check EEL range: Are we inside, outside or overlapping
           eel_pool_size > 0: condition that the range is defined at all */
        if (eel_pool_size > 0u)
        {
            if ( (start_addr_u32 >= eel_pool_start) &&
                 (end_addr <= eel_pool_end) )
            {
                in_eel_range = R_FDL_TRUE;
            }
            else
            {
                if ( !( (end_addr < eel_pool_start) || (start_addr_u32 > eel_pool_end) ) )
                {
                    status = R_FDL_ERR_PARAMETER;
                }
            }
        }

        /* As EEL we must remain in the EEL range */
        if (R_FDL_ACCESS_EEL == access_type_enu)
        {
            if (R_FDL_FALSE == in_eel_range)
            {
                status = R_FDL_ERR_PARAMETER;
            }
        }
        /* As user we must remain in the Data Flash but outside EEL range */
        else if (R_FDL_ACCESS_USER == access_type_enu)
        {
            if ( (end_addr > fdl_pool_end) || (R_FDL_TRUE == in_eel_range) )
            {
                status = R_FDL_ERR_PARAMETER;
            }
        }
        else
        {
            status = R_FDL_ERR_PARAMETER;
        }
    }

    return (status);
} /* R_FDL_ChkAccessBoundaries */


/***********************************************************************************************************************
 * Function name: R_FDL_FCB_Reset
 **********************************************************************************************************************/
/**
 * Reset Flash programming sequencer.
 * As the reset does not work on running sequencer and in case of transient conditions, it must
 * be stopped first.
 *
 * @param      void
 * @return     void
 */
/**********************************************************************************************************************/
#if FDL_COMPILER == FDL_COMP_IAR
    #pragma location = "R_FDL_TEXT"
#elif FDL_COMPILER == FDL_COMP_REC
    #pragma section P R_FDL_TEXT
#endif
void R_FDL_FCB_Reset (void)
{
    volatile uint16_t reg_FSSQ;
    volatile uint16_t reg_FSASTH;

    reg_FSSQ = R_FDL_ReadMemoryU08 (FCB_REGADD_FSSQ_U08);

    /* Stop the sequencer if it is busy */
    if ( FCB_REGBIT_FSSQ_SQST == (reg_FSSQ & FCB_REGBIT_FSSQ_SQST) )
    {
        reg_FSSQ |= FCB_REGBIT_FSSQ_FSSTP;
        R_FDL_WriteMemoryU08 (FCB_REGADD_FSSQ_U08, (uint8_t)reg_FSSQ);

        do
        {
            reg_FSASTH = R_FDL_ReadMemoryU08 (FCB_REGADD_FSASTH_U08);
        }
        while ( 0 == (FCB_REGBIT_FSASTH_SQEND & reg_FSASTH) );

        R_FDL_WriteMemoryU08 (FCB_REGADD_FSSQ_U08, FCB_REGPAT_FSSQ_RESET);

        do
        {
            reg_FSASTH = R_FDL_ReadMemoryU08 (FCB_REGADD_FSASTH_U08);
        }
        while ( 0 != (FCB_REGBIT_FSASTH_SQEND & reg_FSASTH) );
    } /* end if ( FCB_REGBIT_FSSQ_SQST == (reg_FSSQ & FCB_REGBIT_FSSQ_SQST) )*/

    /* Issue reset signal on stopped sequencer */
    R_FDL_WriteMemoryU08 (FCB_REGADD_FLRST_U08, FCB_REGBIT_FLRST_FLRST);
    R_FDL_WriteMemoryU08 (FCB_REGADD_FLRST_U08, FCB_REGBIT_FLRST_FLRST_NOT);
} /* R_FDL_FCB_Reset */


/***********************************************************************************************************************
 * Function name: R_FDL_FCB_SwitchMode
 **********************************************************************************************************************/
/**
 * Switch FCB mode to Programming/User mode
 *
 * @param      mode_enu - switch FCB to mode:
 * @li          R_FDL_FCB_MODE_PE (programming) or
 * @li          R_FDL_FCB_MODE_USER (normal)
 * @return     result of the switch operation
 * @li          R_FDL_OK - switch operation executed
 * @li          R_FDL_ERR_PROTECTION - operation rejected because wrong operation mode
 */
/**********************************************************************************************************************/
#if FDL_COMPILER == FDL_COMP_IAR
    #pragma location = "R_FDL_TEXT"
#elif FDL_COMPILER == FDL_COMP_REC
    #pragma section P R_FDL_TEXT
#endif
r_fdl_status_t R_FDL_FCB_SwitchMode (const r_fdl_fcb_mode_t mode_enu)
{
    volatile uint8_t  reg_FSSET;
    r_fdl_status_t    stat = R_FDL_OK;
    uint16_t          cpu_freq = (g_fdl_data_str.RTCfg_pstr)->fdlFrequencyCpuMHz_u16;

    if (R_FDL_FCB_MODE_USER == mode_enu)
    {
        /* disable P/E mode: set FLPMC register = 0x08 */
        R_FDL_FCB_WriteRegFLPMC (FCB_REGBIT_FLPMC_FWEDIS);

        if (SYSTEM_MODE_HIGH_SPEED == SYSTEM_MODE_MD_HI)                            /* PRQA S 0303 */
        {
            /* High speed operating mode */
            R_FDL_WaitUs (WAIT_TMS_TIME_HS_Us, cpu_freq);
        }
        else
        {
            /* Middle speed operating mode */
            R_FDL_WaitUs (WAIT_TMS_TIME_MS_Us, cpu_freq);
        }

        /* transition to read mode */
        R_FDL_WriteMemoryU16 ( FCB_REGADD_FENTRYR_U16, (uint16_t)(FCB_REGVAL_FENTRYR_CMD) );
    } /*end if (R_FDL_FCB_MODE_USER == mode_enu) */
    else
    {
        /* FCB does not work in low speed mode */
        if (0 == SYSTEM_MODE_LO)                                                    /* PRQA S 0303 */
        {
            R_FDL_WriteMemoryU16 ( FCB_REGADD_FENTRYR_U16, (uint16_t)(FCB_REGVAL_FENTRYR_CMD + FCB_REGBIT_FENTRYRD) );

            if (SYSTEM_MODE_HIGH_SPEED == SYSTEM_MODE_MD_HI)                        /* PRQA S 0303 */
            {
                /* High speed operating mode */
                R_FDL_FCB_WriteRegFLPMC (FCB_REGBIT_FLPMC_EEEMD);
                R_FDL_WaitUs (WAIT_TMS_TIME_HS_Us, cpu_freq);
            }
            else
            {
                /* Middle speed operating mode */
                R_FDL_FCB_WriteRegFLPMC (FCB_REGBIT_FLPMC_EEEMD | FCB_REGBIT_FLPMC_LOWSPY);
                R_FDL_WaitUs (WAIT_TMS_TIME_MS_Us, cpu_freq);
            }

            reg_FSSET = R_FDL_ReadMemoryU08 (FCB_REGADD_FSSET_U08);
            reg_FSSET &= (uint8_t)(FCB_REGMASK_FSSET_FSET_NOT);
            reg_FSSET |= (uint8_t)(g_fdl_data_str.fcb_freq_Mhz - 1u);

            R_FDL_WriteMemoryU08 (FCB_REGADD_FSSET_U08, reg_FSSET);
        } /* end if (0 == SYSTEM_MODE_LO)*/
        else
        {
            stat = R_FDL_ERR_PROTECTION;
        }
    } /*if (R_FDL_FCB_MODE_USER == mode_enu) - else*/

    return (stat);
} /* R_FDL_FCB_SwitchMode */


