andrevcn/MCU_RX100/dataflash/FDL/lib/r_fdl_hw_access.c
/***********************************************************************************************************************
 * Function name: R_FDL_FCB_GetOPAdd
 **********************************************************************************************************************/
/**
 * Read the current operations address from the FCB.
 *
 * @param      void
 * @return     operation address
 */
/**********************************************************************************************************************/
#if FDL_COMPILER == FDL_COMP_IAR
    #pragma location = "R_FDL_TEXT"
#elif FDL_COMPILER == FDL_COMP_REC
    #pragma section P R_FDL_TEXT
#endif
uint32_t R_FDL_FCB_GetOPAdd (void)
{
    uint32_t add;

    add = R_FDL_ReadMemoryU08 (FCB_REGADD_FLAPH_U08);
    add <<= NO_16;
    add += R_FDL_ReadMemoryU16 (FCB_REGADD_FLAPL_U16);

    return (add);
}


/***********************************************************************************************************************
 * Function name: R_FDL_FCB_GetStat
 **********************************************************************************************************************/
/**
 * Return FCB Flash operation result. In case of BC also the fail address is returned.
 * In case of a preceeding Suspend/Resume or Standby/Wakeup, the FCB might already be resetted.
 * In that case, the backed up result is taken from the FDL variables.
 *
 * @param       void
 * @return      Operation result:
 * @li          R_FDL_ERR_BLANKCHECK
 * @li          R_FDL_ERR_WRITE
 * @li          R_FDL_ERR_ERASE
 * @li          R_FDL_BUSY
 * @li          R_FDL_OK
 */
/**********************************************************************************************************************/
#if FDL_COMPILER == FDL_COMP_IAR
    #pragma location = "R_FDL_TEXT"
#elif FDL_COMPILER == FDL_COMP_REC
    #pragma section P R_FDL_TEXT
#endif
r_fdl_status_t R_FDL_FCB_GetStat (uint32_t * failAdd_pu32)
{
    r_fdl_status_t    stat;
    volatile uint16_t reg_FSASTL;
    uint32_t          add;

    if (R_FDL_BUSY != g_fdl_data_str.fcbStatBackup_enu)
    {
        stat = g_fdl_data_str.fcbStatBackup_enu;
        (*failAdd_pu32) = g_fdl_data_str.fcbAddBackup_u32;
        g_fdl_data_str.fcbStatBackup_enu = R_FDL_BUSY;
    }
    else
    {
        /* Read background operation result */
        reg_FSASTL  = R_FDL_ReadMemoryU08 (FCB_REGADD_FSASTL_U08);
        reg_FSASTL &= (uint16_t)(FCB_REGMASK_FSASTL_ERR);

        #ifdef PATCH_TO_SIMULATE_ERRORS
            if (R_FDL_TRUE == g_fdl_data_str.simError_enu)
            {
                switch (g_fdl_data_str.simErrorType_enu)
                {
                    case R_FDL_SIM_ERROR_ERASE:
                    {
                        reg_FSASTL |= FCB_REGBIT_FSASTL_ERER;
                        g_fdl_data_str.simError_enu = R_FDL_FALSE;
                        break;
                    }

                    case R_FDL_SIM_ERROR_WRITE:
                    {
                        reg_FSASTL |= FCB_REGBIT_FSASTL_WRER;
                        g_fdl_data_str.simError_enu = R_FDL_FALSE;
                        break;
                    }

                    case R_FDL_SIM_ERROR_BLANKCHECK:
                    {
                        reg_FSASTL |= FCB_REGBIT_FSASTL_BLER;
                        g_fdl_data_str.simError_enu = R_FDL_FALSE;
                        break;
                    }

                    default:
                    {
                        /* Do Nothing */
                        break;
                    }
                } /* switch */
            } /* end if (R_FDL_TRUE == g_fdl_data_str.simError_enu)*/

            if (g_fdl_data_str.actFlag_FSASTL_enu == R_FDL_TRUE)
            {
                reg_FSASTL = g_fdl_data_str.reg_FSASTL_u08;
                g_fdl_data_str.actFlag_FSASTL_enu = R_FDL_FALSE;
            }
        #endif /* ifdef PATCH_TO_SIMULATE_ERRORS */


        /* Check if the operation finished with an error */
        if (FCB_REGBITS_FSASTL_FLASHOK == reg_FSASTL)
        {
            /* No error -> return value set to OK */
            stat = R_FDL_OK;
        }
        else
        {
            /* Change status to get the same messages in FW and
               User Status Check mode */
            if (  (FCB_REGBIT_FSASTL_BLER == reg_FSASTL)
               && (R_FDL_CMD_BLANKCHECK == (g_fdl_data_str.fdl_reqInt_pstr)->command_enu) )
            {
                stat = R_FDL_ERR_BLANKCHECK;     /* Blank check error */
            }
            else if (  (FCB_REGBIT_FSASTL_WRER == reg_FSASTL)
                    && (R_FDL_CMD_WRITE == (g_fdl_data_str.fdl_reqInt_pstr)->command_enu) )
            {
                stat = R_FDL_ERR_WRITE;          /* Write error */
            }
            else if (  (FCB_REGBIT_FSASTL_ERER == reg_FSASTL)
                    && (R_FDL_CMD_ERASE == (g_fdl_data_str.fdl_reqInt_pstr)->command_enu) )
            {
                stat = R_FDL_ERR_ERASE;          /* Erase error */
            }
            else
            {
                stat = R_FDL_ERR_INTERNAL;
            }

            if (R_FDL_ERR_BLANKCHECK == stat)
            {
                add = R_FDL_ReadMemoryU16 (FCB_REGADD_FLFADH_U16);
                add <<= NO_16;
                add += R_FDL_ReadMemoryU16 (FCB_REGADD_FLFADL_U16);
                (*failAdd_pu32) = add - FDL_DF_BASE_ADD;
            }
        } /* if (FCB_REGBITS_FSASTL_FLASHOK == reg_FSASTL) - else */

        R_FDL_FCB_Reset ();
    } /* if (R_FDL_BUSY != g_fdl_data_str.fcbStatBackup_enu) - else */

    return (stat);
} /* R_FDL_FCB_GetStat */


/***********************************************************************************************************************
 * Function name: R_FDL_FCB_StartFlashOperation
 *********************************************************************************************************************/
/**
 * This function configures the Flash programming sequencer and starts the operation
 *
 * @param  flash_addr_u32       - Start address (1st block address for erase, 1st address for BC/Write)
 * @param  data_or_end_addr_u32 - End address of the Flash operation on Erase, bCnt
 *                                (last block address+1 for erase, last address+1 for BC) or data value in
 *                                case of write operation
 * @param  fcu_cmd_u16          - Type of command. Erase / BC / Write
 * @param  access_type_enu      - User/EEL access (check of access rights)
 *
 * @return status of the operation to start
 * @li     R_FDL_BUSY - operation started
 * @li     R_FDL_ERR_PROTECTION - operation blocked due to protection
 */
/**********************************************************************************************************************/
#if FDL_COMPILER == FDL_COMP_IAR
    #pragma location = "R_FDL_TEXT"
#elif FDL_COMPILER == FDL_COMP_REC
    #pragma section P R_FDL_TEXT
#endif
r_fdl_status_t R_FDL_FCB_StartFlashOperation (uint32_t flash_addr_u32,
                                              uint32_t data_or_end_addr_u32,
                                              uint16_t fcu_cmd_u16,
                                              const r_fdl_accessType_t access_type_enu)
{
    r_fdl_status_t status;
    uint8_t        data;

    flash_addr_u32 += FDL_DF_BASE_ADD;

    R_FDL_WriteMemoryU16 ( FCB_REGADD_FLAPL_U16, (uint16_t)(flash_addr_u32 & 0xFFFFu) );
    R_FDL_WriteMemoryU08 ( FCB_REGADD_FLAPH_U08, (uint8_t)(flash_addr_u32 >> 16u) );

    if (FCB_REGPAT_FSSQ_CMD_WRT == fcu_cmd_u16)
    {
        /* write */
        R_FDL_WriteMemoryU16 (FCB_REGADD_FLSEDL_U16, 0x0000u);
        R_FDL_WriteMemoryU08 (FCB_REGADD_FLSEDH_U08, 0x00u);

        /* write one byte at a time */
        data = R_FDL_ReadMemoryU08 (data_or_end_addr_u32);
        R_FDL_WriteMemoryU16 (FCB_REGADD_FLWL0_U16, (uint16_t)data);
    }
    else
    {
        /* erase */
        data_or_end_addr_u32 += FDL_DF_BASE_ADD;
        R_FDL_WriteMemoryU16 ( FCB_REGADD_FLSEDL_U16, (uint16_t)(data_or_end_addr_u32 & 0xFFFFu) );
        R_FDL_WriteMemoryU08 ( FCB_REGADD_FLSEDH_U08, (uint8_t)(data_or_end_addr_u32 >> 16u) );
    }

    status = R_FDL_ChkAccessRight (access_type_enu, fcu_cmd_u16);

