andrevcn/MCU_RX100/dataflash/FDL/lib/r_fdl_hw_access.c
    if (R_FDL_BUSY == status)
    {
        /* Start FLash operation */
        R_FDL_WriteMemoryU08 (FCB_REGADD_FSSQ_U08, (uint8_t)fcu_cmd_u16);
        fcu_cmd_u16 |= FCB_REGBIT_FSSQ_SQST;
        R_FDL_WriteMemoryU08 (FCB_REGADD_FSSQ_U08, (uint8_t)fcu_cmd_u16);
    }

    return (status);
} /* R_FDL_FCB_StartFlashOperation */


/***********************************************************************************************************************
 * Function name: R_FDL_FCB_ChkReady
 **********************************************************************************************************************/
/**
 * Returns sequencer busy/Ready status \n
 * The sequencer might be busy or not busy (not configured or configured operation already
 * finished)
 *
 * @param   void
 * @return  Status of the sequencer
 * @li      R_FDL_TRUE  - Sequencer is not busy with a Flash operation
 * @li      R_FDL_FALSE - Sequencer is busy with a Flash operation
 */
/**********************************************************************************************************************/
#if FDL_COMPILER == FDL_COMP_IAR
    #pragma location = "R_FDL_TEXT"
#elif FDL_COMPILER == FDL_COMP_REC
    #pragma section P R_FDL_TEXT
#endif
r_fdl_flag_t R_FDL_FCB_ChkReady (void)
{
    r_fdl_flag_t     status;
    volatile uint8_t reg_FSASTH;
    volatile uint8_t reg_FSSQ;

    reg_FSSQ   = R_FDL_ReadMemoryU08 (FCB_REGADD_FSSQ_U08);
    reg_FSASTH = R_FDL_ReadMemoryU08 (FCB_REGADD_FSASTH_U08);

    /* Check if FCB is operating */
    if ( 0 != (reg_FSASTH & FCB_REGBIT_FSASTH_SQEND) )
    {
        /* Reset FSSQ register and wait for reset to finish */
        R_FDL_WriteMemoryU08 (FCB_REGADD_FSSQ_U08, FCB_REGPAT_FSSQ_RESET);

        do
        {
            reg_FSASTH = R_FDL_ReadMemoryU08 (FCB_REGADD_FSASTH_U08);
        }
        while ( 0 != (FCB_REGBIT_FSASTH_SQEND & reg_FSASTH) );

        status = R_FDL_TRUE;
    }
    else if ( 0 == (reg_FSSQ & FCB_REGBIT_FSSQ_SQST) )
    {
        /* FCB is not busy */
        status = R_FDL_TRUE;
    }
    else
    {
        status = R_FDL_FALSE;
    }

    return (status);
} /* R_FDL_FCB_ChkReady */

